{
    "listOfEvents": [
        {
            "id": 1,
            "name": "Abertura oficial",
            "image": "https://onovolab.com/wp-content/uploads/2023/06/onovolab_corporativo.jpeg",
            "imageDesc": "OnovoLab",
            "author": "ONOVOLAB",
            "date": "28 de agosto 19h - 21h30",

            "description": "A abertura oficial da IV Wecomp acontecerá no ONOVOLAB e contará com a presença de empresas parceiras, uma mesa redonda com o tema 'IA generativa, mercado de trabalho e a carreira dos (novos) desenvolvedores' e uma confraternização. Não perca!"
        },
        {
            "id": 2,
            "name": "Como é o dia-a-dia de um QA?",
            "image": "../../eventsImages/cerminaro.jpeg",
            "imageDesc": "Cerminaro",
            "author": "Leonardo Cerminaro",
            "date": "28 de agosto 8h - 12h",
            "vacancies" : 30,
            "classification": "livre",
            

            "description": "Nesse workshop, será demonstrado de maneira prática algumas atividades rotineiras de um profissional que trabalha como QA. Iniciaremos a parte de criação de casos de teste, execução dos casos de testes criados, explicação de conceitos de Engenharia de Software na prática e criação dos testes automatizados utilizando Javascript e Cypress. Além disso, falaremos de certificações e de como se especializar ainda mais nessa área importante dentro do desenvolvimento de software."
        },
        {
            "id": 3,
            "name": "Criando Micro-serviços em Golang",
            "image": "../../eventsImages/go.png",
            "imageDesc": "Gustavo e Vinicius",
            "author": "Gustavo Okuyama e Vinícius Silva",
            "date": "29 e 30 de agosto 8h - 12h",
            "vacancies" : 20,
            "classification": "intermediario",
            

            "description": "Aprenda a criar micro-serviços em Go, uma das linguagens de programação mais valorizadas do mercado!  Neste curso vamos  conhecer a linguagem, criar duas aplicações e as conectá-las usando as principais bibliotecas do ecossistema Go. Explore o potencial dessa linguagem de programação moderna e eficiente, ampliando suas habilidades como desenvolvedor e descobrindo seus principais casos de uso no mundo da tecnologia."
        },
        {
            "id": 4,
            "name": "InstallFest Linux",
            "image": "../../eventsImages/pedro.png",
            "imageDesc": "Pedro Nobile",
            "author": "Pedro Nobile",
            "date": "01 de setembro 8h - 10h",
            "vacancies" : 20,
            "classification": "livre",
            

            "description": "Conhecer Linux e compreender o básico de seu uso é requisito essencial a qualquer desenvolvedor de sofware. O InstallFest Linux é um evento dedicado a abrir as portas desse poderoso sistema operacional aos futuros desenvolvedores. Durante o encontro, será fornecido apoio técnico personalizado para instalação da sua primeira distribuição Linux, sem afetar seu sistema operacional atual.  Explore as vantagens do Linux na programação e no desenvolvimento de software e abra novas oportunidades em sua carreira tecnológica. Traga seu computador e um pendrive para participar."
        },
        {
            "id": 5,
            "name": "Como sobreviver no terminal do Linux",
            "image": "../../eventsImages/carlao.jpeg",
            "imageDesc": "Carlão Pereira",
            "author": "Carlão Pereira",
            "date": "01 de setembro 10h - 12h",
            "vacancies" : 30,
            "classification": "livre",
            

            "description": "Este mini-curso apresentará uma breve história da filosofia do Software Livre e do surgimento do sistema operacional Linux, focando em seguida nos principais comandos para dominar o terminal e executar tarefas com agilidade e eficiência. Desde comandos básicos de navegação até operações mais avançadas, serão exploradas ferramentas essenciais para gestão de arquivos, instalação de programas, gerenciamento de processos, entre outros, de uma forma totalmente prática."
        }
    ]
}