{
    "listOfEvents": [
        {
            "id": 1,
            "name": "Abertura oficial",
            "image": "../../eventsImages/onovolab.png",
            "imageDesc": "OnovoLab",
            "author": "ONOVOLAB",
            "date": "28 de agosto",
            "time": "19h - 21h30",

            "description": "A abertura oficial da IV Wecomp acontecerá no ONOVOLAB e contará com a presença de empresas parceiras, uma mesa redonda com o tema 'IA generativa, mercado de trabalho e a carreira dos (novos) desenvolvedores' e uma confraternização. Não perca!"
        },
        {
            "id": 2,
            "name": "Como é o dia-a-dia de um QA?",
            "image": "../../eventsImages/cerminaro.jpeg",
            "imageDesc": "Cerminaro",
            "author": "Leonardo Cerminaro",
            "date": "28 de agosto",
            "time": "8h - 12h",
            "vacancies" : 30,
            "classification": "livre",
            

            "description": "Nesse workshop, serão demonstradas de maneira prática algumas atividades rotineiras de um profissional que trabalha como QA. Iniciaremos a parte de criação de casos de teste, execução dos casos de testes criados, explicação de conceitos de Engenharia de Software na prática e criação dos testes automatizados utilizando Javascript e Cypress. Além disso, falaremos de certificações e de como se especializar ainda mais nessa área importante dentro do desenvolvimento de software."
        },
        {
            "id": 2.1,
            "name": "Criando um aplicativo de clima com Flutter",
            "image": "../../eventsImages/davi.png",
            "imageDesc": "Davi Guelfi Erba",
            "author": "Davi Guelfi Erba",
            "date": "28 de agosto",
            "time": "8h - 12h",
            "vacancies" : 30,
            "classification": "livre",
            

            "description": "Neste minicurso os participantes irão aprender como criar um aplicativo para visualizar dados metereologicos (clima) utilizando o Flutter. É um curso básico para os que querem conhecer essa tecnologia de desenvolvimento híbrida que é uma das mais utilizadas hoje em dia no mercado de trabalho."
        },
        {
            "id": 3,
            "name": "Criando Micro-serviços em Golang",
            "image": "../../eventsImages/go.png",
            "imageDesc": "Gustavo e Vinicius",
            "author": "Gustavo Okuyama e Vinícius Silva",
            "date": "29 e 30 de agosto",
            "time": "8h - 12h",
            "vacancies" : 20,
            "classification": "intermediario",
            

            "description": "Aprenda a criar micro-serviços em Go, uma das linguagens de programação mais valorizadas do mercado!  Neste curso vamos  conhecer a linguagem, criar duas aplicações e as conectá-las usando as principais bibliotecas do ecossistema Go. Explore o potencial dessa linguagem de programação moderna e eficiente, ampliando suas habilidades como desenvolvedor e descobrindo seus principais casos de uso no mundo da tecnologia."
        },
        {
            "id": 3.1,
            "name": "Talk Minsait - A transformação da infraestrutura de aplicações para CloudNative no setor de Seguros",
            "image": "../../eventsImages/talk_minsait.png",
            "imageDesc": "Talk Minsait",
            "author": "Carlos Eduardo Leite",
            "date": "29 de agosto",
            "time": "19h - 21h",
            "vacancies" : 100,
            "classification": "intermediario",
            

            "description": "Nesta palestra a Minsait abordarerá as vantagens da computação em nuvem, como elasticidade, automação e gerenciamento simplificado onde a combinação desses componentes permite a construção de aplicativos altamente escaláveis, resilientes e flexíveis, capazes de aproveitar ao máximo as vantagens da nuvem e acelerar a inovação nos negócios. Também serão apresentadas informações sobre a empresa e processos seletivos."
        },
        {
            "id": 4,
            "name": "Introdução à Ciência de Dados - Da teoria ao Deploy em 240 minutos.",
            "image": "../../eventsImages/luana_tiago.png",
            "imageDesc": "Luana Terra e Tiago Corrêa",
            "author": "Luana Terra e Tiago Corrêa",
            "date": "31 de agosto",
            "time": "8h - 12h",
            "vacancies" : 30,
            "classification": "livre",
            

            "description": "Esse minicurso aborda conceitos básicos de ciência de dados, ferramentas para se trabalhar com os dados, exemplos de modelos de predição (estimação e classificação) e um jeito fácil e rápido de dar deploy com Streamlit. O curso é introdutório e não é necessário conhecimento prévio na área, mas conhecimento em Python é desejável."
        },
        {
            "id": 4.1,
            "name": "InstallFest Linux",
            "image": "../../eventsImages/pedro.png",
            "imageDesc": "Pedro Nobile",
            "author": "Pedro Nobile",
            "date": "01 de setembro",
            "time": "8h - 10h",
            "vacancies" : 20,
            "classification": "livre",
            

            "description": "Conhecer Linux e compreender o básico de seu uso é requisito essencial a qualquer desenvolvedor de sofware. O InstallFest Linux é um evento dedicado a abrir as portas desse poderoso sistema operacional aos futuros desenvolvedores. Durante o encontro, será fornecido apoio técnico personalizado para instalação da sua primeira distribuição Linux, sem afetar seu sistema operacional atual.  Explore as vantagens do Linux na programação e no desenvolvimento de software e abra novas oportunidades em sua carreira tecnológica. Traga seu computador e um pendrive para participar."
        },
        {
            "id": 5,
            "name": "Como sobreviver no terminal do Linux",
            "image": "../../eventsImages/carlao.jpeg",
            "imageDesc": "Carlão Pereira",
            "author": "Carlão Pereira",
            "date": "01 de setembro",
            "time": "10h - 12h",
            "vacancies" : 30,
            "classification": "livre",
            

            "description": "Este mini-curso apresentará uma breve história da filosofia do Software Livre e do surgimento do sistema operacional Linux, focando em seguida nos principais comandos para dominar o terminal e executar tarefas com agilidade e eficiência. Desde comandos básicos de navegação até operações mais avançadas, serão exploradas ferramentas essenciais para gestão de arquivos, instalação de programas, gerenciamento de processos, entre outros, de uma forma totalmente prática."
        }
    ]
}